package day06_while;

public class Quiz03 {
	public static void main(String[] args) {
		// 쌀100통이 저장되있는 창고에 암수 1쌍쥐, 쥐 한마리가 하루에 20쌀을 먹고
		// 10일(10,20,30)마다 쥐의 수가 2개씩 증가, 며칠만에 창고의 쌀이 없어질까
		// 그때 주니느 총 몇마리?
		
		
		
		
		
		
		
		
		//두수의 최소 공배수와 최대 공약수를 구하는 프로그램
		// 최소공배수 = 공배수 중 가장 작은 정수
		// 최대 공약수 = 공약수 중 가장 큰 수
		
		
		
		
		
		
		// 어떤 수의 약수를 주하는 프로그램 작성
	    // 약수 = 어떤 수를 정수로 나눌 수 있는 수
		
		
		
		
		
		
		
		
		
		
		
		//1에서 1000까지의 자연수중 4와 6으로 나누면 나머지가 1인 수 합
		
	/*	int i=0;
		int sum=0;
		for(i=1;i<=1000;i++) {
			if(i%4 == 1 && i%6 == 1) {
				sum= sum+i;
			}
		}System.out.println("합 : "+sum);
		*/
		
		
		
		
		
		
		
		
		
	}
}
